jmeter.log
2018-01-26 16:53:15,722 INFO o.a.j.u.JMeterUtils: Setting Locale to pt_BR
2018-01-26 16:53:15,745 INFO o.a.j.JMeter: Loading user properties from: /home/daniel/programs/apache-jmeter-3.3/bin/user.properties
2018-01-26 16:53:15,745 INFO o.a.j.JMeter: Loading system properties from: /home/daniel/programs/apache-jmeter-3.3/bin/system.properties
2018-01-26 16:53:15,753 INFO o.a.j.JMeter: Copyright (c) 1998-2017 The Apache Software Foundation
2018-01-26 16:53:15,753 INFO o.a.j.JMeter: Version 3.3 r1808647
2018-01-26 16:53:15,753 INFO o.a.j.JMeter: java.version=1.8.0_91
2018-01-26 16:53:15,753 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2018-01-26 16:53:15,753 INFO o.a.j.JMeter: os.name=Linux
2018-01-26 16:53:15,753 INFO o.a.j.JMeter: os.arch=amd64
2018-01-26 16:53:15,753 INFO o.a.j.JMeter: os.version=4.10.0-37-generic
2018-01-26 16:53:15,753 INFO o.a.j.JMeter: file.encoding=UTF-8
2018-01-26 16:53:15,753 INFO o.a.j.JMeter: Max memory     =536870912
2018-01-26 16:53:15,753 INFO o.a.j.JMeter: Available Processors =2
2018-01-26 16:53:15,763 INFO o.a.j.JMeter: Default Locale=português (Brasil)
2018-01-26 16:53:15,764 INFO o.a.j.JMeter: JMeter  Locale=português (Brasil)
2018-01-26 16:53:15,764 INFO o.a.j.JMeter: JMeterHome=/home/daniel/programs/apache-jmeter-3.3
2018-01-26 16:53:15,764 INFO o.a.j.JMeter: user.dir  =/home/daniel/programs/apache-jmeter-3.3/plains
2018-01-26 16:53:15,764 INFO o.a.j.JMeter: PWD       =/home/daniel/programs/apache-jmeter-3.3/plains
2018-01-26 16:53:15,765 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: daniel-P-79 FullName: daniel-P-79
2018-01-26 16:53:15,769 INFO o.a.j.s.FileServer: Default base='/home/daniel/programs/apache-jmeter-3.3/plains'
2018-01-26 16:53:15,769 INFO o.a.j.s.FileServer: Set new base='/home/daniel/programs/apache-jmeter-3.3/plains'
2018-01-26 16:53:16,019 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2018-01-26 16:53:16,037 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2018-01-26 16:53:16,044 INFO o.a.j.s.SaveService: Using SaveService properties version 3.2
2018-01-26 16:53:16,054 INFO o.a.j.s.SaveService: Loading file: test.jmx
2018-01-26 16:53:16,127 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-01-26 16:53:16,127 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-01-26 16:53:16,127 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-01-26 16:53:16,127 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-01-26 16:53:16,127 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2018-01-26 16:53:16,127 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2018-01-26 16:53:16,177 INFO o.a.j.JMeter: Creating summariser <summary>
2018-01-26 16:53:16,187 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2018-01-26 16:53:16,188 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2018-01-26 16:53:16,188 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2018-01-26 16:53:16,194 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2018-01-26 16:53:16,194 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2018-01-26 16:53:16,862 INFO o.a.j.JMeter: Testes executando (1516992796862)
2018-01-26 16:53:16,919 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : jp@gc - Ultimate Thread Group Script
2018-01-26 16:53:16,920 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group jp@gc - Ultimate Thread Group Script.
2018-01-26 16:53:16,920 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2018-01-26 16:53:16,920 INFO k.a.j.t.AbstractSimpleThreadGroup: Starting thread group number 1 threads 5
2018-01-26 16:53:16,935 INFO k.a.j.t.AbstractSimpleThreadGroup: Started thread group number 1
2018-01-26 16:53:16,935 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2018-01-26 16:53:22,920 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Ultimate Thread Group Script 1-5
2018-01-26 16:53:22,931 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2018-01-26 16:53:22,931 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2018-01-26 16:53:22,931 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2018-01-26 16:53:22,931 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2018-01-26 16:53:28,920 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Ultimate Thread Group Script 1-4
2018-01-26 16:53:30,477 INFO o.a.j.r.Summariser: summary +      2 in 00:00:14 =    0,1/s Avg:  3762 Min:  3752 Max:  3772 Err:     0 (0,00%) Active: 2 Started: 2 Finished: 0
2018-01-26 16:53:34,920 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Ultimate Thread Group Script 1-3
2018-01-26 16:53:40,921 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Ultimate Thread Group Script 1-2
2018-01-26 16:53:46,920 INFO o.a.j.t.JMeterThread: Thread started: jp@gc - Ultimate Thread Group Script 1-1
2018-01-26 16:54:00,048 INFO o.a.j.r.Summariser: summary +     37 in 00:00:30 =    1,3/s Avg:  2990 Min:   993 Max:  3959 Err:     0 (0,00%) Active: 5 Started: 5 Finished: 0
2018-01-26 16:54:00,050 INFO o.a.j.r.Summariser: summary =     39 in 00:00:43 =    0,9/s Avg:  3030 Min:   993 Max:  3959 Err:     0 (0,00%)
2018-01-26 16:54:30,085 INFO o.a.j.r.Summariser: summary +     41 in 00:00:30 =    1,4/s Avg:  3641 Min:  1265 Max:  3789 Err:     0 (0,00%) Active: 5 Started: 5 Finished: 0
2018-01-26 16:54:30,086 INFO o.a.j.r.Summariser: summary =     80 in 00:01:13 =    1,1/s Avg:  3343 Min:   993 Max:  3959 Err:     0 (0,00%)
2018-01-26 16:54:56,319 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: jp@gc - Ultimate Thread Group Script 1-5
2018-01-26 16:54:56,319 INFO o.a.j.t.JMeterThread: Thread finished: jp@gc - Ultimate Thread Group Script 1-5
2018-01-26 16:55:00,164 INFO o.a.j.r.Summariser: summary +     42 in 00:00:30 =    1,4/s Avg:  3497 Min:  1742 Max:  3784 Err:     0 (0,00%) Active: 4 Started: 5 Finished: 1
2018-01-26 16:55:00,166 INFO o.a.j.r.Summariser: summary =    122 in 00:01:43 =    1,2/s Avg:  3396 Min:   993 Max:  3959 Err:     0 (0,00%)
2018-01-26 16:55:00,933 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: jp@gc - Ultimate Thread Group Script 1-4
2018-01-26 16:55:00,933 INFO o.a.j.t.JMeterThread: Thread finished: jp@gc - Ultimate Thread Group Script 1-4
2018-01-26 16:55:05,150 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: jp@gc - Ultimate Thread Group Script 1-3
2018-01-26 16:55:05,150 INFO o.a.j.t.JMeterThread: Thread finished: jp@gc - Ultimate Thread Group Script 1-3
2018-01-26 16:55:14,429 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: jp@gc - Ultimate Thread Group Script 1-2
2018-01-26 16:55:14,429 INFO o.a.j.t.JMeterThread: Thread finished: jp@gc - Ultimate Thread Group Script 1-2
2018-01-26 16:55:18,307 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: jp@gc - Ultimate Thread Group Script 1-1
2018-01-26 16:55:18,308 INFO o.a.j.t.JMeterThread: Thread finished: jp@gc - Ultimate Thread Group Script 1-1
2018-01-26 16:55:18,309 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2018-01-26 16:55:18,310 INFO o.a.j.r.Summariser: summary +     14 in 00:00:18 =    0,8/s Avg:  3287 Min:  2230 Max:  3872 Err:     0 (0,00%) Active: 0 Started: 5 Finished: 5
2018-01-26 16:55:18,311 INFO o.a.j.r.Summariser: summary =    136 in 00:02:01 =    1,1/s Avg:  3385 Min:   993 Max:  3959 Err:     0 (0,00%)